{
  "site": {
    "title": "Zaklínač – zápisky z knih",
    "subtitle": "Poslední přání + Meč osudu • přehled po povídkách + rejstřík"
  },
  "books": [
    {
      "id": "pp",
      "title": "Poslední přání",
      "shortTitle": "Poslední přání",
      "subtitle": "Poslední přání je sbírka povídek, kde Geralt postupně naráží na monstra i lidi – a často zjistí, že to druhý bývá horší. Každá povídka řeší jiný morální průser (prokletí, předsudky, “menší zlo”), ale dohromady to skládá základ světa a pravidel, podle kterých (ne)funguje. A hlavně: je tu klíčový start vztahu Geralta a Yennefer a první velký kopanec od “osudu”.",
      "year": null,
      "cover": "assets/img/covers/posledni-prani.webp",
      "images": [
        {
          "src": "assets/img/covers/posledni-prani.webp",
          "caption": "Cover (volitelné)"
        }
      ],
      "chapters": [
        {
          "id": "hlas-rozumu",
          "title": "Hlas rozumu (rámec)",
          "typeBadge": "rámcový děj",
          "summary": "Geralt se po těžkým zranění dává dohromady v chrámu Melitelé. V rozhovorech s Nenneke se řeší neutralita, pověst zaklínačů a tlak okolí. Rámec postupně propojuje ostatní povídky.",
          "notes": "Tip: sem se hodí obrázek chrámu / Ellanderu.",
          "image": "assets/img/chapters/ellander.webp",
          "people": ["Geralt", "Nenneke", "Iola", "Marigold"],
          "places": [
            { "name": "Ellander (chrám Melitelé)", "ruler": "král Foltest (Temerie)" }
          ],
          "tags": ["chrám", "melitelé", "ellander", "neutralita", "marigold"]
        },
        {
          "id": "zaklinac",
          "title": "Zaklínač",
          "typeBadge": "povídka",
          "summary": "Ve Vizimě řeší dvůr krále Foltesta prokletí, které se zvrhlo v strigu – monstrum ohrožující lidi i stabilitu celého království. Geralt je vtaženej do hry, kde se míchá strach, moc a předsudky: nejde jen o zakázku, ale o to, kdo na ní politicky vydělá a kdo ji chce naopak zamést pod koberec. Klíčový je samotnej střet se strigou v opuštěném sídle/ruinách spojených s její minulostí, kde Geralt místo „zabití“ zkusí prokletí zlomit a dotáhne to až do svítání.",
          "image": "assets/img/chapters/vizima.webp",
          "people": ["Geralt", "král Foltest", "striga"],
          "places": [
            { "name": "Vizima", "ruler": "král Foltest (Temerie)" }
          ],
          "tags": ["vizima", "foltest", "striga", "prokletí", "politika"]
        },
        {
          "id": "zrnko-pravdy",
          "title": "Zrnko pravdy",
          "typeBadge": "povídka",
          "summary": "Geralt narazí na odlehlý, zchátralý sídlo, kde žije Nivellen – na první pohled „příšera“ s tělem chlapa a zvířecí (lví) hlavou, protože je pod prokletím. Postupně vyjde najevo, že věci nejsou černobílý: Nivellen není klasický monstrum na zabití a největší hrůza se skrývá jinde – v jeho vztahu k Vereeně, která se ukáže být skutečnou nebezpečnou bytostí. Příběh je hlavně o tom, co je „příšera“ a co jen maska, a že některý prokletí živí spíš lidi než magie.",
          "image": "assets/img/chapters/zrnko.webp",
          "people": ["Geralt", "Nivellen", "Vereena"],
          "places": [
            { "name": "odloučené panství (lokace neuvedena)", "ruler": "neuveden" }
          ],
          "tags": ["prokletí", "nivellen", "morálka", "předsudky"]
        },
        {
          "id": "mensi-zlo",
          "title": "Menší zlo",
          "typeBadge": "povídka",
          "summary": "Geralt se v Blavikenu zaplete do konfliktu mezi čarodějem Stregoborem a ženou jménem Renfri. Stregobor chce, aby Geralt Renfri zabil (bere ji jako hrozbu/“zrozenou pro zlo” a bojí se, že si pro něj přijde), ale Geralt to odmítne, protože nemá důkaz, že je to monstrum na „zakázku“ – byla by to spíš vražda na objednávku a navíc “preventivně”. Jenže neutralita se mu rozpadne pod rukama, když Renfri začne tlačit situaci tak, že hrozí masakr nevinných, a Geralt nakonec jedná, aby tomu zabránil.",
          "image": "assets/img/chapters/mensi-zlo.webp",
          "people": ["Geralt", "Renfri", "Stregobor"],
          "places": [
            { "name": "Blaviken", "ruler": "neuveden" }
          ],
          "tags": ["blaviken", "renfri", "stregobor", "neutralita", "dilema"]
        },
        {
          "id": "otazka-ceny",
          "title": "Otázka ceny",
          "typeBadge": "povídka",
          "summary": "Na dvoře v Cintrě vládne královna Calanthé a řeší se politika kolem sňatku její dcery Pavetty. Do toho přijde prokletej rytíř Duny (Ježek) a nárokuje si Pavettu na základě Zákona překvapení (Law of Surprise): kdysi zachránil život jejímu otci a ten mu slíbil „to, co doma najde, a nečeká“. Pavetta byla právě tím “překvapením”, takže se podle danýho slibu a pravidel dvora (a taky aby se nezlomil závazek s politickejma následkama) musí rozhodnout, jestli Dunyho přijme.",
          "image": "assets/img/chapters/cintra.webp",
          "people": ["Geralt", "královna Calanthé", "Pavetta", "Duny (Ježek)"],
          "places": [
            { "name": "Cintra", "ruler": "královna Calanthé" }
          ],
          "tags": ["cintra", "calanthe", "pavetta", "law-of-surprise", "dvůr"]
        },
        {
          "id": "konec-sveta",
          "title": "Konec světa",
          "typeBadge": "povídka",
          "summary": "V povídce Konec světa jde Geralt s Marigoldem do kraje na hraně lidskýho osídlení, kde vesničani/sedláci žijou v klasickým strachu z “čertů” a nestvůr. Ukáže se, že ten jejich „čert“ je ve skutečnosti sylván Torque, trochu provokatér, co krade obilí pro vyhnané elfy, kteří se skrývají v okolí. Geralt tak víc pozoruje, než seká – a vidí, že lidi a nelidi (elfové) jedou každej svůj příběh, jejich pravdy se míjejí a starý křivdy nikam nezmizely, jen čekají na další jiskru.",
          "image": "assets/img/chapters/konec-sveta.webp",
          "people": ["Geralt", "Marigold", "Toruviel", "Filavandrel"],
          "places": [
            { "name": "kraj na hraně lidskýho osídlení (konkrétní město neuvedeno)", "ruler": "neuveden" }
          ],
          "tags": ["elfové", "nelidé", "toruviel", "filavandrel", "hranice"]
        },
        {
          "id": "posledni-prani",
          "title": "Poslední přání",
          "typeBadge": "povídka",
          "summary": "Magie se rozjede, až to začne bejt nebezpečný i pro město. Geralt a Marigold se zamotají do událostí kolem džina – a hlavně do setkání s Yennefer. Tahle povídka definuje jeden z nejdůležitějších vztahů celé ságy.",
          "image": "assets/img/chapters/dzin.webp",
          "people": ["Geralt", "Marigold", "Yennefer", "džin"],
          "places": [
            { "name": "město (v povídce ne vždy explicitně zafixováno jako „město X“)", "ruler": "neuveden" }
          ],
          "tags": ["yennefer", "džin", "marigold", "osud", "magie"]
        }
      ]
    },
    {
      "id": "mo",
      "title": "Meč osudu",
      "shortTitle": "Meč osudu",
      "subtitle": "Meč osudu je druhá sbírka povídek, kde už nejde tolik o „zakázky“, ale víc o vztahy, důsledky a to, že osud si tě stejně najde, i když se mu vyhýbáš. Klíčový je tu Geraltův kontakt s Ciri a postupný posun od neutrality k tomu, že některý věci prostě musíš vzít na sebe. A zároveň to dál rozvíjí svět lidí vs. nelidí, politikaření a cenu „trochy oběti“.",
      "year": null,
      "cover": "assets/img/covers/mec-osudu.webp",
      "images": [
        {
          "src": "assets/img/covers/mec-osudu.webp",
          "caption": "Cover (volitelné)"
        }
      ],
      "chapters": [
        {
          "id": "hranice-moznosti",
          "title": "Hranice možností",
          "typeBadge": "povídka",
          "summary": "Hon na draka přitáhne šlechtu, lovce i kouzelnice – každej z jinýho důvodu. Geralt je v tom jako „ten, kdo ví, jak to opravdu chodí“, ale stejně narazí na hranice kompromisů. A znovu: největší zlo často nejsou monstra.",
          "image": "assets/img/chapters/drak.webp",
          "people": ["Geralt", "Yennefer", "Marigold", "Borch Tři Kavky"],
          "places": [
            { "name": "cesta / tábořiště (konkrétní město neuvedeno)", "ruler": "neuveden" }
          ],
          "tags": ["drak", "borch", "yennefer", "konflikt", "morálka"]
        },
        {
          "id": "stripek-ledu",
          "title": "Střípek ledu",
          "typeBadge": "povídka",
          "summary": "Vztahová povídka, která řeže víc než meč. Geralt a Yennefer naráží na limity toho, co od sebe čekají – a co jsou schopní dát. Je to studený, nepříjemný a zároveň strašně lidský.",
          "image": "assets/img/chapters/led.webp",
          "people": ["Geralt", "Yennefer", "Istredd"],
          "places": [
            { "name": "Aedd Gynvael (město)", "ruler": "neuveden" }
          ],
          "tags": ["yennefer", "istredd", "vztahy", "emoce", "aedd-gynvael"]
        },
        {
          "id": "vecny-ohen",
          "title": "Věčný oheň",
          "typeBadge": "povídka",
          "summary": "V Novigradu se řeší doppler, identita a to, jak málo lidi opravdu vidí do života druhých. Dudu není „zlej“, spíš se snaží přežít a najít si místo. Geralt s Marigoldem to rozmotají a výsledkem je vlastně dost nečekaná „oprava“ života jednoho půlčíka.",
          "image": "assets/img/chapters/novigrad.webp",
          "people": ["Geralt", "Marigold", "Dainty Biberveldt", "Dudu", "Chappelle", "Vimme Vivaldi"],
          "places": [
            { "name": "Novigrad", "ruler": "Hierarcha Novigradu (neuvedeno jménem)" }
          ],
          "tags": ["novigrad", "doppler", "dudu", "chappelle", "vivaldi"]
        },
        {
          "id": "trochu-obeti",
          "title": "Trochu oběti",
          "typeBadge": "povídka",
          "summary": "V Trochu oběti se Geralt motá kolem zakázky u moře, ale hlavní emoce jedou přes příběh lásky mezi mořskou pannou Sh’eenaz a knížetem Aglovalem, kterej si ji chce vzít – jenže oba světy mají svoje pravidla a nikdo nechce ustoupit. Do toho vstupuje Essi Daven (Marigoldova kamarádka, bardka), která tráví čas s Geraltem a je tam krásně vidět, jak věci “mimo kontrakt” umí bolet víc než jakýkoliv monstrum. Výsledek je pohádka narvaná realitou: něco se dá vyřešit magií, ale cenu za city a volby si stejně každej zaplatí sám.",
          "image": "assets/img/chapters/more.webp",
          "people": ["Geralt", "Dandelion/Marigold", "Essi Daven", "Agloval", "Sh'eenaz"],
          "places": [
            { "name": "Bremervoord", "ruler": "kníže Agloval" }
          ],
          "tags": ["bremervoord", "essi", "agloval", "moře", "oběť"]
        },
        {
          "id": "mec-osudu",
          "title": "Meč osudu",
          "typeBadge": "povídka",
          "summary": "Brokilon není jen les – je to pravidlo, hranice a jiná kultura. Geralt se tu potká s Ciri v situaci, která vypadá náhodně… ale svět Zaklínače se ti směje do ksichtu: osud. Základní stavební kámen pro další díly.",
          "image": "assets/img/chapters/brokilon.webp",
          "people": ["Geralt", "Ciri", "Eithné", "dryády"],
          "places": [
            { "name": "Brokilon", "ruler": "královna Eithné" }
          ],
          "tags": ["brokilon", "ciri", "eithne", "osud", "dryády"]
        },
        {
          "id": "neco-vic",
          "title": "Něco víc",
          "typeBadge": "povídka",
          "summary": "V Něco víc se Geralt po událostech války potácí zraněnej a narazí na kupce Yurgu, kterej ho vezme na vůz a snaží se ho dostat do bezpečí. Cestou Geralt kvůli zranění blouzní a mezi realitou se mu řežou flashbacky (minulý zakázky, rozhodnutí, Yennefer, osudový momenty) – přesně ten typ “účtování”, kdy už neutralita zní jen jako výmluva. Jak se probírá, je jasný, že svět se rozpadá na chaos a že „jen práce“ neexistuje, protože všechno má následky. A pak přijde to něco víc: setkání, který potvrdí, že osud si ho našel stejně, a to spojení už nepůjde brát jako náhodu.",
          "image": "assets/img/chapters/neco-vic.webp",
          "people": ["Geralt", "Ciri", "Yurga", "Visenna"],
          "places": [
            { "name": "cesta / venkov (místo není jedno konkrétní město)", "ruler": "neuveden" }
          ],
          "tags": ["osud", "ciri", "válka", "yurga", "visenna"]
        }
      ]
    }
  ],
  "entities": {
    "people": [
      {
        "key": "geralt",
        "name": "Geralt",
        "desc": "Zaklínač – profesionál na monstra, kterej se pořád snaží držet neutralitu, i když mu to svět systematicky znemožňuje.",
        "image": "assets/img/people/geralt.webp",
        "aliases": ["Bílý vlk", "Řezník z Blavikenu"]
      },
      {
        "key": "yennefer",
        "name": "Yennefer",
        "desc": "Kouzelnice s tvrdým pragmatismem a komplikovaným vztahem ke Geraltovi. Umí být brutálně upřímná i zranitelná.",
        "image": "assets/img/people/yennefer.webp",
        "aliases": ["Yen"]
      },
      {
        "key": "ciri",
        "name": "Ciri",
        "desc": "Dítě osudu. Setkání s Geraltem je klíčový bod celé ságy.",
        "image": "assets/img/people/ciri.webp",
        "aliases": ["Cirilla"]
      },
      {
        "key": "marigold",
        "name": "Marigold",
        "desc": "Básník, kamarád a průser-magnet. Často komentuje dění s nadhledem, ale umí být i vážnej, když jde do tuhýho.",
        "image": "assets/img/people/marigold.webp",
        "aliases": ["Dandelion", "Jaskier"]
      }
    ],
    "places": [
      {
        "key": "vizima",
        "name": "Vizima",
        "ruler": "král Foltest (Temerie)",
        "desc": "Hlavní město Temerie, kde se potkává politika, intriky a „problémy“, které se zametají pod koberec.",
        "image": "assets/img/places/vizima.webp",
        "aliases": []
      },
      {
        "key": "cintra",
        "name": "Cintra",
        "ruler": "královna Calanthé",
        "desc": "Dvůr, politika a osud – tady se řeší věci, který budou mít následky i o několik knih dál.",
        "image": "assets/img/places/cintra.webp",
        "aliases": []
      },
      {
        "key": "novigrad",
        "name": "Novigrad",
        "ruler": "Hierarcha Novigradu (neuvedeno jménem)",
        "desc": "Obchodní město a centrum kultu Věčného ohně. Dokonalé místo pro příběhy o identitě a pokrytectví.",
        "image": "assets/img/places/novigrad.webp",
        "aliases": []
      },
      {
        "key": "brokilon",
        "name": "Brokilon",
        "ruler": "královna Eithné",
        "desc": "Les dryád – vlastní pravidla, žádná romantika, spíš test hranic a osudu.",
        "image": "assets/img/places/brokilon.webp",
        "aliases": []
      }
    ],
    "chapters": []
  }
}
